{"ratings": 254, "userreviews": [{"userName": "Kiri", "userReviewDate": "Sep 24, 2010", "userURL": "http://www.goodreads.com/user/show/1849033-kiri", "userReview": "This is a great little book (probably aimed at middle-school kids, but great reading even for adults) telling a short version of the story of the Constitutional Convention.  It is peppered with little tidbits about the delegates (like fishing habits or what they wrote home to their children) that give them personality and humanity.  Told in simple and straightforward language, it also hits on all of the hot-button topics that would ultimately lead to four months of deliberation and debate: state rights, representation, slavery, how to choose a president, etc.  I also gained a better sense of the important distinction between the terms \"national\" (a central government with power over the states) and \"federal\" (a government of an association of states that give up none of their individual rights).  The original Constitution never used the word \"national\" because it was so offensive to many of the delegates.  Our states therefore were joined into a federation, and not a nation, to create the United States of America.  Overall, an enjoyable and educational read.  The full text (and it's not very long) of the original Constitution is included at the end of the book. \"We the people\" never fails to inspire a little thrill of pride."}, {"userName": "Nancy", "userReviewDate": "Nov 02, 2008", "userURL": "http://www.goodreads.com/user/show/1545012-nancy", "userReview": "Any book by Jean Fritz get my 5 star rating!  I have my students at the University read this book as an introduction to the time period. So historically accurate, so delightfully detailed, so short, so funny, so readable."}, {"userName": "Robert", "userReviewDate": "Jul 01, 2012", "userURL": "http://www.goodreads.com/user/show/1661541-robert", "userReview": "I think this would be an excellent book to read with my fourth graders.  So much so that I am now looking into electronic classroom wish lists so I can list the book.  I don't seem to be able to find enough copies used to make it worthwhile to purchase a class set.Fritz has a way of describing history well.  I really liked this book  Admittedly, I am a fan of the Revolutionary period and the Constitution specifically.  I do carry a copy in my breast pocket!Anyhow, this book pretty much describes the ending of the fourth grade social studies curriculum I teach.  Unfortunately, Fritz does not use the term New Jersey Plan to describe the part of the Great Compromise that create the balance in the Senate that we have.  The plan is described accurately, just not named so.One gains a pretty good feel for the struggle our forefathers had in crafting our government.  We learn of the different sides of terms like federal and national.  And we see how some were not in favor of a federal government preferring the states to remain sovereign (can you hear me, George Mason?).  If anyone would like to donate a copy of this book for my fourth graders to use, let me know and I will provide the particulars.  That is how much I enjoyed reading this!"}, {"userName": "Denise Krebs", "userReviewDate": "Jul 05, 2012", "userURL": "http://www.goodreads.com/user/show/4522949-denise-krebs", "userReview": "Again, Jean Fritz does such a good job of taking a dry subject and adding life. For instance, I learned that during a break from the Constitution Convention Oliver Ellsworth wrote a letter home about visiting an Egyptian mummy on display in Philadelphia and how he opened it up so he could see what the flesh was like. That is a horrific fact, but there are occasional such engagements for young readers. Details about the first July 4th parade and celebration in Philadelphia were great too!However, as I read this book, with all my background knowledge about the Constitution, I wasn't fully engaged on every page. I continue to realize how important passion and choice are for students. If a student is interested in government and specifically the U.S. Constitution, this book would be awesome. If not, it would be hard for a young person to sit through the whole book, which is only 44 pages.I also always love the pictures by Tomie dePaola."}, {"userName": "Brooke", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/7521957-brooke", "userReview": "BiographyIn fifth grade, we learned a great deal about the Revolutionary war. Then when we were done that unit, we went straight to the Civil War. We missed such an important part of American history! This book teaches us such key topics that I feel students should know, like how to pick a president, state rights, slavery, and representation. America had succeeded from England, then they had to write an entire constitution! This book is an easy way to explain to students what our founding fathers went through to make our country what it is today. It also eases the passage way from  the Revolutionary War to the Civil War, since they had to make some changes to the constitution after the civil war, for instance: abolishing slavery."}, {"userName": "Heather", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/1212796-heather", "userReview": "Hmmm, I thought I had written a big long review for this, but I guess I didn't.This was a solid introduction to the events leading up to the Convention as well as some of the debates that occurred.  My boys were able to understand the Virginia plan and why the smaller states had issues with some things.  The book briefly touched on the conflict between Northern and Southern states as well.It'd difficult to condense everything that was said and all the personalities into one book for children.  Fritz did a good job.  While I think this is a good choice, I will continue to try to find one I like better.  But I wouldn't hesitate to use this again."}, {"userName": "Tracey", "userReviewDate": "Oct 05, 2013", "userURL": "http://www.goodreads.com/user/show/4127186-tracey", "userReview": "\"Shh! We're Writing the Constitution\" should be a must read for every elementary school student! This book presents the summer of 1787 in a manner students can understand. Humor is thrown in, as well, to bring the Founding Fathers to life! I am considering the inclusion of this book into our classroom activities.  Any adult would find this book intriguing, too, especially if they don't know much about the Constitutional Convention. Pick up this book and read it! You can read it in less than an hour!"}, {"userName": "Ruth", "userReviewDate": "Jan 24, 2012", "userURL": "http://www.goodreads.com/user/show/833647-ruth", "userReview": "A good story-based introduction to the constitution. It was a bit fact-heavy for a picture book, and it would have been nice if it was divided up into chapters; it was hard to find good stopping points. Some of this was over my seven year old's head, but she got the general idea that deciding on our country's firm of government was not an easy decision and it took a while for the delegates to agree."}, {"userName": "Nicole", "userReviewDate": "Apr 19, 2013", "userURL": "http://www.goodreads.com/user/show/13230104-nicole", "userReview": "Written in a way that students can understand the history that made up the United States.  This book is a little long, but if you pull out parts you need for lessons or have the book be optional for students to read it can be manageable.  I learned a lot and would definitely read this book again for a refesher on the Constitution and other historical events that shaped our country."}, {"userName": "Tye", "userReviewDate": "Jan 22, 2014", "userURL": "http://www.goodreads.com/user/show/11446171-tye", "userReview": "This was great for me as a refresher on the Constituion."}, {"userName": "Laura", "userReviewDate": "Feb 03, 2011", "userURL": "http://www.goodreads.com/user/show/875677-laura", "userReview": "This is a wonderful story to read to younger children about the creation of our country's constitution.  It covers all the basic problems our constitutional congress faced and the solutions they settled on.  It has very entertaining and helpful pictures as well! Grades 2 - 6.I love all of Jean Fritz's historical books!  I highly recommend them all!"}, {"userName": "Carol", "userReviewDate": "Mar 31, 2008", "userURL": "http://www.goodreads.com/user/show/350705-carol", "userReview": "I read this with my daughter, who is 8. I enjoyed it a lot. It was informative, funnny and had a lot of interesting trivia. Who knew Benjamin Franklin came to the convention in a Chinese sedan chair carried by four prisoners from a Philadelphia jail? I think I got more out of it than A did, though. Hopefully, she picked up some bits and pieces."}, {"userName": "Nicole Flores", "userReviewDate": "Apr 10, 2011", "userURL": "http://www.goodreads.com/user/show/4203420-nicole-flores", "userReview": "This is another one of Jean Fritz's wonderful stories. This is a historical fiction book about how hard it was to come up with this document and the importance of it. I would do this as a read aloud because it is a high level book but it is definitly important and it puts the writing of the constitution in perspective."}, {"userName": "O2snowwhite", "userReviewDate": "Aug 01, 2011", "userURL": "http://www.goodreads.com/user/show/1575474-o2snowwhite", "userReview": "I LOVE this book!  As with any of Fritz's books, you can tell that history is her passion.  It's a little long for younger kids, but packed full of awesome information, some of which is more trivial and less-known, but helps bring the \"characters\" to life."}, {"userName": "Etta Mcquade", "userReviewDate": "Feb 13, 2010", "userURL": "http://www.goodreads.com/user/show/3275419-etta-mcquade", "userReview": "Jean Fritz, in her usual sense of humor, reveals the personalities of the various constitutional delegates, yet at the same time is able to show the great task that they had undertaken.  Excellent for grade school children."}, {"userName": "Mrs.Garcia", "userReviewDate": "Jul 02, 2011", "userURL": "http://www.goodreads.com/user/show/5658276-mrs-garcia", "userReview": "Great information. Easy read, but I'll probably read portions to my class. Might be tough for my fourth graders to get through. I loved it, but it is not exactly high interest for them."}, {"userName": "Vicky", "userReviewDate": "Apr 22, 2012", "userURL": "http://www.goodreads.com/user/show/2903437-vicky", "userReview": "I have enjoyed all of Jean Fritz's books, I think I know all about a person she has written about, but she has ALWAYS found some small bit of information that I find fascinating."}, {"userName": "Amy", "userReviewDate": "May 30, 2013", "userURL": "http://www.goodreads.com/user/show/7841913-amy", "userReview": "Post Revolution, of course, but we were on a Fritz kick and we couldn't stop!  Such interesting trivia sprinkled through this book - it makes the story really memorable."}, {"userName": "Ethan", "userReviewDate": "Apr 20, 2012", "userURL": "http://www.goodreads.com/user/show/7584128-ethan", "userReview": "I didn't really like this book because it was boring and I already knew most of the stuff they talked about. I did learn a little, though."}, {"userName": "Sharon", "userReviewDate": "Nov 11, 2011", "userURL": "http://www.goodreads.com/user/show/3940819-sharon", "userReview": "Decent writ but I felt that many important details were left out so that some more humorous spots could be added."}, {"userName": "Jessica", "userReviewDate": "Apr 14, 2011", "userURL": "http://www.goodreads.com/user/show/4193164-jessica", "userReview": "*Constitution**Bill of Rights**Constitutional Convention**Articles of Confederation**George Washington*"}, {"userName": "Anibas", "userReviewDate": "Jun 06, 2008", "userURL": "http://www.goodreads.com/user/show/1013529-anibas", "userReview": "I have to read this book while I am on vacation this week.  So far it is boring so my mom is going to read it with me."}, {"userName": "Joenna", "userReviewDate": "Mar 11, 2008", "userURL": "http://www.goodreads.com/user/show/52411-joenna", "userReview": "An in-depth look at the making of the Constitution.  Very informative and great for school reports!"}, {"userName": "Skye", "userReviewDate": "Sep 21, 2011", "userURL": "http://www.goodreads.com/user/show/1852772-skye", "userReview": "Lots of info about the constitution (and the actual constitution in the back)."}, {"userName": "Caren", "userReviewDate": "Jun 11, 2012", "userURL": "http://www.goodreads.com/user/show/1790048-caren", "userReview": "A perfect little book that explains the process to write up the Constition."}, {"userName": "Sally", "userReviewDate": "Sep 27, 2008", "userURL": "http://www.goodreads.com/user/show/806278-sally", "userReview": "Her autobiography about growing up in China looks interesting, too."}, {"userName": "Rachel", "userReviewDate": "Mar 10, 2011", "userURL": "http://www.goodreads.com/user/show/4193199-rachel", "userReview": "Talks about how they wrote they constitution and the government."}, {"userName": "Tessa", "userReviewDate": "May 04, 2012", "userURL": "http://www.goodreads.com/user/show/7342321-tessa", "userReview": "Fantastic!  A must read."}, {"userName": "John", "userReviewDate": "Jan 21, 2008", "userURL": "http://www.goodreads.com/user/show/140121-john", "userReview": "interesting details!!!"}, {"userName": "Jack", "userReviewDate": "Sep 30, 2011", "userURL": "http://www.goodreads.com/user/show/6493772-jack", "userReview": "I read it at school"}], "description": "This factual gem that's written with Jean Fritz's humorous touch chronicles the hot summer of 1787 where fifty-five delegates from thirteen states huddled together in the strictest secrecy in Philadelphia to draw up the constitution of the United States!", "title": "Shh! We're Writing the Constitution", "url": "http://www.goodreads.com/book/show/823068.Shh_We_re_Writing_the_Constitution", "average": 3.69, "cover": "http://d.gr-assets.com/books/1311281895l/823068.jpg", "reviews": 32, "authors": [{"url": "http://www.goodreads.com/author/show/231.Jean_Fritz", "name": "Jean Fritz"}, {"url": "http://www.goodreads.com/author/show/8725.Tomie_dePaola", "name": "Tomie dePaola"}], "outlinks": ["http://www.goodreads.com/book/show/29819.The_Landing_of_the_Pilgrims", "http://www.goodreads.com/book/show/89963.If_You_Were_There_When_They_Signed_The_Constitution", "http://www.goodreads.com/book/show/227569.A_History_of_US", "http://www.goodreads.com/book/show/880161.Phoebe_the_Spy", "http://www.goodreads.com/book/show/4821.If_You_Sailed_On_The_Mayflower", "http://www.goodreads.com/book/show/1357471.The_Thanksgiving_Story", "http://www.goodreads.com/book/show/6471.Meet_George_Washington", "http://www.goodreads.com/book/show/955192.We_the_Kids", "http://www.goodreads.com/book/show/843454.World_War_II", "http://www.goodreads.com/book/show/6415223-before-columbus", "http://www.goodreads.com/book/show/203411.Ben_Franklin", "http://www.goodreads.com/book/show/563098.George_Washington", "http://www.goodreads.com/book/show/470980.Sarah_Morton_s_Day", "http://www.goodreads.com/book/show/295474.Cleopatra", "http://www.goodreads.com/book/show/196791.Homesick", "http://www.goodreads.com/book/show/823069.The_Cabin_Faced_West", "http://www.goodreads.com/book/show/427325.And_Then_What_Happened_Paul_Revere_", "http://www.goodreads.com/book/show/58472.What_s_The_Big_Idea_Ben_Franklin_", "http://www.goodreads.com/book/show/196757.Can_t_You_Make_Them_Behave_King_George_"]}