{"ratings": 2769, "userreviews": [{"userName": "John Yelverton", "userReviewDate": "Dec 02, 2011", "userURL": "http://www.goodreads.com/user/show/5928256-john-yelverton", "userReview": "This is one of the most touching stories that you will ever read."}, {"userName": "Cassidy Shea", "userReviewDate": "Nov 21, 2011", "userURL": "http://www.goodreads.com/user/show/2520623-cassidy-shea", "userReview": "\"Suppose you should be walking down Broadway after dinner, with ten minutes allotted to the consummation of your cigar while you are choosing between a diverting tragedy and something serious in the way of vaudeville. Suddenly a hand is laid upon your arm. You turn to look into the thrilling eyes of a beautiful woman, wonderful in diamonds and Russian sables. She thrusts hurriedly into your hand an extremely hot buttered roll, flashes out a tiny pair of scissors, snips off the second button of your overcoat, meaningly ejaculates the one word, \"parallelogram!\" and swiftly flies down a cross street, looking back fearfully over her shoulder.\" (opening paragraph of the 4th story in this collection, \"The Green Door\")this collection of o. henry stories was a delight to read! i'm always interested to find out what the twist ending of each story will be. it never turns out how i had imagined! my favorites were \"the cop and the anthem\", \"the last leaf\", and \"the ransom of red chief\". i'm very happy to have impulse-bought this book."}, {"userName": "Haley", "userReviewDate": "May 29, 2013", "userURL": "http://www.goodreads.com/user/show/846874-haley", "userReview": "During the reading this week, I felt that I was really able to see O. Henry’s personality in the stories. One of my favorite parts was the beginning of “Springtime a la Carte” on page 10:“It was a day in March.Never, never begin a story this way when you write one. No opening could possibly be worse. It is unimaginative, flat, dry and likely to consist of mere wind. But in this instance it is allowable. For the following paragraph, which should have inaugurated the narrative, is too wildly extravagant and preposterous to be flaunted in the face of the reader without preparation.”And then he started the story. I almost laughed!!! He totally broke the boundaries that few authors even bend. He was “breaking the 4th wall” (as some may call it) and I loved it. (He did it again on page 12.) His style was different and exciting. His stories were very comical to me, which seems to be what everyone else thinks. Every now and then, he would have a very random sentence like:“He had a telephone in his cow house, and he could figure up exactly what effect next year’s Canada wheat crop would have on potatoes planted in the dark of the moon.” (“Springtime a la Carte”)That seemed pretty random (and hilarious) to me. Here’s another one:“She got out ‘The Cloister and the Hearth,’ the best non-selling book of the month…” (“Springtime a la Carte.” If you can’t tell, that story was one of my favorites!  )It’s no wonder that everyone else seems to like his the best so far. Plus, each of the stories seemed to end with irony. Hawthorne’s style was more formal and eloquent than the others and Poe’s seemed more expressive and thrilling. Then you’ve got O. Henry. He was very conversational in his writing as if saying, “Here’s a story I once heard…” For some reason, I really like that style a lot. However, after a while, it was really simple to see his style and therefore predict the ending. For many of the stories, I felt that they needed a bigger and more exciting (and almost mysterious) ending since they all seemed to have a puzzle-like storyline. For example, I loved the Green Door because of the mysterious feel throughout it. However, the ending was quite disappointing for me. I was really hoping for an amazing (and, for some reason, strange) ending to flow with the enigma theme. However with his ending it was not as exciting anymore and the thrill was gone. Some of them were predictable like “After Twenty Years” and “The Pimienta Pancakes” (which I thought was a strange story). Overall I really liked them, though!!"}, {"userName": "Jason Daly", "userReviewDate": "Oct 06, 2014", "userURL": "http://www.goodreads.com/user/show/35678475-jason-daly", "userReview": "The Gift of the Magi and Other Short Stories is a compelling book consisting of ten short stories that all come together to symbolize life and all the wonders that come with it. Although the stories all have different plots and settings, the characters are all relatable and despite unique events portrayed in each story, it almost seems as if all the stories somehow connect to each other. Among these short stories are tales of a poor couple that will do anything to purchase elegant gifts fr their significant other, a man’s quest to save the love of his life from the sickness that is infecting his town, a girl whom is trapped away in a castle and her story of escape, and a woman looking for her long lost love. These stories, and the many more found within the book, are what makes this book something truly unique and a book that is well worth reading. I would recommend this book to anyone looking for a new view on life, and insight onto the lives of so many different people."}, {"userName": "Sergei Barsamian", "userReviewDate": "Jun 14, 2014", "userURL": "http://www.goodreads.com/user/show/2131547-sergei-barsamian", "userReview": "Wow, what an unusual mix of urban sadness and optimist Western thinking. There are no story endings so unexpected and genial as O.Henry's. The Gift of Magi and other stories, written by the humanist author in prison, will leave thoughtful melancholy in the soul of the reader forever..."}, {"userName": "Ashley Snarr", "userReviewDate": "Oct 21, 2014", "userURL": "http://www.goodreads.com/user/show/19753767-ashley-snarr", "userReview": "What I loved about these short stories is how they help you look back and ponder on your life experiences and how you treated people. I had heard the gift of the magi before, and I remember the first time I heard it I was frustrated because neither one really got a useful gift. Then I read it the second time and I realized the moral behind the story, and how it is showing true love for a person, not just gift giving. It made me ponder on what I have always viewed Christmas time as, and if I pay attention to the people I love enough to know what would be a special gift for them. This book is a great reminder to think about others and remember what the true meaning of love and friendships are."}, {"userName": "Hillary", "userReviewDate": "Oct 20, 2014", "userURL": "http://www.goodreads.com/user/show/35027575-hillary", "userReview": "I have grown up with the story of the gift of the Magi. My mom would always tell it to me orally every Christmas. Even though I didn't see an actual picture book of the story until I was fifteen, but I have always loved how the story was one of love and sacrifice. It was special for me to read the original version and see how much detail goes into this sweet story. I think that all of these short stories are great to have around the home at any age. They are easily applicable, and it makes anyone think. It's not just about pure entertainment, it's what good stories are all about!"}, {"userName": "Angela", "userReviewDate": "Dec 02, 2011", "userURL": "http://www.goodreads.com/user/show/2565272-angela", "userReview": "The Gift of the Magi - the first story in the book, and the one I am most familiar with. It still makes me tear up. The Cop and the Anthem - I had not read this story before. It was a cute story about perseverance. Springtime a la Carte - another story I had not read before. What an enjoyable little love story. The Green Door - all about what we expect to see and a little bit of fate After Twenty Years -- an interesting reunion story. Funny where life takes you.The Furnished Room - a little sad. Almost a ghost story, but not quite. The Pimienta Pancakes -- a tricked suitor, not my favorite story. The Last Leaf -- SOOO good, and so sad, but sweet. I absolutely love this story!!!The Voice of the City -- eh. I didn't particularly like this story. It rambled a bit.While the Auto Waits -- another tale of found love...maybeA Retrieved Reformation -- nothing the love of a good woman can't overcome. Cute story about a second chanceA Municipal Report -- a long story, but it ends well. While the language used to describe the black man is despicable in today's world, the treatment of the man is better than I have read in modern tales. Royalty indeed.A Newspaper Story -- a very short story about the power of the press, even when it doesn't tryThe Ransom of Red Chief -- I remember seeing the televised version of this story. Cute tale about a not-so-cute kidA Ghost of a Chance -- a cute little story about taking chancesMakes the Whole World Kin -- another cute story about how we are all really the same"}, {"userName": "Nely", "userReviewDate": "Nov 26, 2008", "userURL": "http://www.goodreads.com/user/show/1440151-nely", "userReview": "This book is my first introduction to O.Henry and his mischievous twists of fate to all his story endings. I was forewarned about these twists and tried to guess throughout all the stories - but I was always surprised. I found this quite delightful. This book is a compilation of his short stories written between 1906 - 1911 including:- The Gift of the Magi- The Cop and the Anthem- Springtime a la Carte- The Green Door- After Twenty Years- The Furnished Room- The Pimienta Packages- The Last Leaf- The Voice of the City- While the Auto Waits- A Retrieved Reformation- A Municipal Report- A Newspaper Story- The Ransom of Red Chief- A Ghost of a Chance- Makes the Whole World KinI truly enjoyed The Gift of the Magi (a story about love being more powerful than earthly possessions), The Cop and the Anthem (actually made me laugh out loud), Springtime a la Carte (I’m a sucker for love), The Pimienta Pancakes (so funny and ironic), The Last Leaf (because it was beautiful), and The Ransom of Red Chief (hilarious). The other stories weren’t to my taste but still interesting enough to read. I don’t want to give you more than that so I don’t ruin them for you, but it was a very quick and entertaining read."}, {"userName": "Erin Eve", "userReviewDate": "Nov 19, 2012", "userURL": "http://www.goodreads.com/user/show/10251193-erin-eve", "userReview": "An ambrosial collection of really quirky, whimsical stories, often with a twist in the end that keeps the reader on their toes and engaged in guessing.  Some are love stories and some aren't; some have happy endings and some don't; O. Henry does not limit himself to one type of story and the scope of his imagination ranges from the comfortingly traditional to the wildly obscure.  One of my favorites was one told from the point of view of a dog, who kept swearing by Sirius.  While some are as short as three pages long Henry somehow manages to pack in rich character development, place description, and plot, overcoming the apparent limitations of a short story and trumping the efforts of meandering novelists who take a much longer road to get to a watered-down point.  I was introduced to O. Henry's work in my 8th grade English class when we read the Gift of the Magi, which for some reason seems to be his most popular story, but not the one I would consider the best.  I definitely intend on making a project of reading the rest of his works in the future."}, {"userName": "Amy", "userReviewDate": "Mar 19, 2010", "userURL": "http://www.goodreads.com/user/show/563794-amy", "userReview": "I enjoyed reading some of the lesser-known ironic stories of O. Henry in this book. My very favorite lesser-known story in this book is \"The Green Door\" in which a man receives a mysterious business card which simply says \"The Green Door\". The man is intrigued because he finds that everyone else has been handed a business card for a dentist office rather than for \"the green door\". So, of course, he has to go in search of this mysterious green door. I love the course of the story. I don't understand why this one isn't as famous as others like \"Gifts of the Magi\" and \"The Ransom of Red Chief\" because it certainly ranks up there.Other stories I enjoyed from the book:*\"Springtime á la Carte\" - an accidental second-chance at romance*\"After 20 Years\" - what happens when old friends plan to meet each other at a certain spot in 20 years*\"While the Auto Waits\" - is romance possible between the very rich and the very poor?*\"Makes the Whole World Kin\" - a thief bonds with his victimI have to say, though, that some of the language and cultural references in some of the stories didn't hold up to time and left me a bit confused. And there were some stories here that just weren't interesting. Thus, the 4 stars rather than 5."}, {"userName": "Steven", "userReviewDate": "Aug 08, 2014", "userURL": "http://www.goodreads.com/user/show/1730072-steven", "userReview": "A good selection of some of O. Henry’s most noted stories, including the classic “The Ransom of Red Chief,” “The Cop and the Anthem,” and “The Retrieved Reformation.”  The surprise endings in the earlier stories become a little wearisome and almost formulaic, but the later stories are more complex and insightful.  In all of his writing, however, O. Henry is a playful and witty stylist, and I had to consult the dictionary to learn the meaning of some his more operatic words."}, {"userName": "Erika", "userReviewDate": "Sep 23, 2014", "userURL": "http://www.goodreads.com/user/show/10120188-erika", "userReview": "I felt like some of the stories didn't relate to today's world anymore, while some rang true. His stories have morals. That is something that is missing in some books, movies, etc. His style of writing was difficult for me to read, although my vocabulary grew. There were a lot of words I didn't understand. He wrote these stories for the people of his time and I feel like they were more intelligent than we are now."}, {"userName": "Alexis Priestley", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/34959824-alexis-priestley", "userReview": "I like this collection of short stories. I think the plots are well told and they're fun to think and talk about. I especially enjoyed the first two stories which was The Gift of the Magi and The Last Leaf. I think those are two wonderful stories and incredibly thought provoking. They're just the kind of stories that really resonate and make you feel like a better person just for reading! (:"}, {"userName": "Shelley", "userReviewDate": "Jan 12, 2011", "userURL": "http://www.goodreads.com/user/show/1100764-shelley", "userReview": "During his 5 years he served in prison in 1898, O. Henry wrote this book.  It is ten short stories that were published under the pseudonym O. Henry.  His real name was William Sydney Porter.  I've never read his work before or heard of him, so when I came across this book in my 17 year old son's bookcase, I thought why not.  I really enjoyed O. Henry's writing and would had given it 3-1/2 stars instead of 3 if Goodreads gave out 1/2 stars.  I love how each story has a twist and turn.  I also love reading in this time period and how much it's different today.  O. Henry's most famous story is \"The Gift of Magi\", but I found the ending too sad, though I loved the couple's happiness and felt in through his words.  My favorite stories were, \"The Last Leaf\", \"Springtime a la Carte\", \"A Chaparral Prince\" and \"The Hiding of a Black Bill\"."}, {"userName": "PurplyCookie", "userReviewDate": "Mar 29, 2010", "userURL": "http://www.goodreads.com/user/show/2214498-purplycookie", "userReview": "A young woman makes a drastic decision--and her husband has a Christmas surprise in return. A dying girl attaches her fate to that of a leaf. A writer sobs at the sight of a menu. \"The Gift of the Magi\" with \"The Last Leaf,\" is the best of them all. But I'm afraid I wasn't too impressed with the other short stories featured in this collection. Although the stories use a vocabulary and style that are reflective of the author's own era (O. Henry lived from 1862 to 1910), the humor and irony of the stories still shine. This book can serve as a good introduction to the great writing of one of America's most prolific short story writers. Book Details: Title The Gift of the Magi and Other StoriesAuthor O. Henry Reviewed By Purplycookie"}, {"userName": "Austin Francis", "userReviewDate": "Oct 21, 2014", "userURL": "http://www.goodreads.com/user/show/27525255-austin-francis", "userReview": "I was misled by my teacher that this was a young child's book.  I would say it is definitely for older children if you are planning on using this in the classroom.  I thought the stories were very meaningful.  A little confusing, but then again, it was written a long time ago."}, {"userName": "Tamara", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/1994314-tamara", "userReview": "I wish there were half stars, because this would get 4.5. It's beautiful storytelling that appeals to all ages. It's vivid imagery makes it wonderful for children without pandering or condescending to them and its complexity makes it fun for adults as well."}, {"userName": "Meagan Pack", "userReviewDate": "Oct 15, 2014", "userURL": "http://www.goodreads.com/user/show/17320584-meagan-pack", "userReview": "This is a great book! There are lots of the classic little holiday stories that are warming to the heart. They also have great motives and lessons.  I think that kids could learn a lot about caring for others from this collection of stories."}, {"userName": "Michelle", "userReviewDate": "Nov 28, 2014", "userURL": "http://www.goodreads.com/user/show/1200378-michelle", "userReview": "I haven't really read O. Henry since I was in a high school lit class.  It was an enjoyable foray back into short stories with the master of irony.  Some are less convincing than others but the gems are a treat."}, {"userName": "Kiera Marsh", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/27644893-kiera-marsh", "userReview": "While I enjoyed The Gift of the Magic, it was not my favorite of the stories. My favorite was The Last Leaf because it showed a wider range of emotion and the story resonated more with me than the others."}, {"userName": "Timothy McNeil", "userReviewDate": "Feb 24, 2014", "userURL": "http://www.goodreads.com/user/show/7363204-timothy-mcneil", "userReview": "Not terrible, but I am not a fan of inserting difficult to understand (regional) diction into a story as a graft meant for credibility.  I was only truly impressed with one story, though knowing how O. Henry works, much of overall impression results from how the story ends."}, {"userName": "s", "userReviewDate": "Apr 07, 2013", "userURL": "http://www.goodreads.com/user/show/4152463-s", "userReview": "By turns satisfying and frustrating. The prose is gloriously purple and the twists are unmissable. At the best it's a rhinestone roller coaster, gaudy and great. But it can also be annoying: Take the last few stories in the collection, e.g. \"The Roads of Destiny\": if he'd ended several paragraphs earlier, and evaded the twinges of racism (e.g. \"the Jew from Armenia, who sold anything that came to his hand\") the pieces would have been much more satisfying; instead they were a insulting. Still, there are good moments. My favorites, aside from his most famous story, were \"A Retrieved Reformation\", \"One Thousand Dollars\", \"After 20 Years\", and \"The Clarion Call\"."}, {"userName": "Nargiz", "userReviewDate": "Oct 21, 2013", "userURL": "http://www.goodreads.com/user/show/21214118-nargiz", "userReview": "O.Henry might be considered as American Checkov.  The similar point between two writers is short and precise plot instead of long and tedious description. However, O.Henry is a great optimist than Anton Chekhov. You feel a great enthusiasm to live in his stories even in those which don’t have happy endings. Of course, two great masters can’t be compared as they address different faults of society, but for me the name of one always reminds the name of another because of writing style.O.Henry’s stories are something that you always would like to read no matter whether you are a schoolchild or mature person. His stories are among my highest recommended list."}, {"userName": "Christine", "userReviewDate": "Sep 08, 2009", "userURL": "http://www.goodreads.com/user/show/1154250-christine", "userReview": "We all know the gift of the Magi story and all it's variations but there were a lot of other interesting stories in here as well. None of the other ones related at all with Christmas and most of them were about robbers and murderers either getting away with their crimes or being caught by the police. I found some sappy, some far fetched, some hard to follow (maybe because of the writing style and the time period in which it was written), but a few of them were actually heartwarming or at least enjoyable. Some of my other favorites were The Last Leaf (though a little sappy), The Chaparral Prince, The Hiding of Black Bill and A Retrieved Reformation."}, {"userName": "Natasha Stewart", "userReviewDate": "Dec 16, 2014", "userURL": "http://www.goodreads.com/user/show/35009758-natasha-stewart", "userReview": "This is a wonderful book full of stories that are written well and full of emotion. It is a great book to read during the holiday season and is for all ages. We have read this book in my family for many years now and always are excited to each read our separate favorite story. This is a amazing book and I encourage all to snuggle up during the holiday season with those you love to read it."}, {"userName": "ShaLisa", "userReviewDate": "May 08, 2012", "userURL": "http://www.goodreads.com/user/show/1128348-shalisa", "userReview": "I loved this book!  I only wish each short story was a novel.  O. Henry is able to introduce the characters until you feel they are your friends and a short 10 to 15 pages later, the story is over and you have to start all over meeting the next characters only for that relationship to end abruptly as well.  I loved the sentiments of the stories.  I loved the language and writing style.  I loved the feeling.I have heard the story The Gift of the Magi many times before but never told as beautiful as O. Henry tells it.  It is almost a shame to me that others have been afforded the opportunity to alter it."}, {"userName": "Abbey", "userReviewDate": "Jan 25, 2012", "userURL": "http://www.goodreads.com/user/show/4437424-abbey", "userReview": "BOTTOM LINE: smooth, old-fashioned, twisty stories, often with a nice little punch at the end. A truly \"classic\" writer (translation= not just an old-fashioned one - too many folks use \"classic\" to mean simply \"old\", IMO). Excellent compendium of  stories by the fabled writer, still interesting even if most of the twists seem terribly old-fashioned now. A classic author who is still (deservedly, in my opinion) often read in schools, his style is very slow and thoughful when compared with current mores, but it's worthwhile hanging in there and reading his work, a little bit at a time, perhaps?"}, {"userName": "Valerie", "userReviewDate": "Aug 13, 2014", "userURL": "http://www.goodreads.com/user/show/552692-valerie", "userReview": "I read these stories years and years ago and loved them.  Maybe it's time to reread these classics?"}, {"userName": "Julie Surface", "userReviewDate": "Oct 16, 2014", "userURL": "http://www.goodreads.com/user/show/35052961-julie-surface", "userReview": "about devotion and love. this was a cute short story!"}], "description": "Here are sixteen of the best stories by one of America's most popular storytellers. For nearly a century, the work of O. Henry has delighted readers with its humor, irony and colorful, real-life settings. The writer's own life had more than a touch of color and irony. Born William Sidney Porter in Greensboro, North Carolina in 1862, he worked on a Texas ranch, then as a bank teller in Austin, then as a reporter for the Houston \"Post.\" Adversity struck, however, when he was indicted for embezzlement of bank funds. Porter fled to New Orleans, then to Honduras before he was tried, convicted and imprisoned for the crime in 1898. In prison he began writing stories of Central America and the American Southwest that soon became popular with magazine readers. After his release Porter moved to New York City, where he continued writing stories under the pen name O.HenryThough his work earned him an avid readership, O. Henry died in poverty and oblivion scarcely eight years after his arrival in New York. But in the treasury of stories he left behind are such classics of the genre as \"The Gift of the Magi,\" \"The Last Leaf,\" \"The Ransom of Red Chief,\" \"The Voice of the City\" and \"The Cop and the Anthem\" — all included in this choice selection. A selection of the Common Core State Standards Initiative.", "title": "The Gift of the Magi and Other Short Stories", "url": "http://www.goodreads.com/book/show/31626.The_Gift_of_the_Magi_and_Other_Short_Stories", "average": 4.11, "cover": "http://d.gr-assets.com/books/1371670064l/31626.jpg", "reviews": 121, "authors": [{"url": "http://www.goodreads.com/author/show/8993.O_Henry", "name": "O. Henry"}], "outlinks": ["http://www.goodreads.com/book/show/19785847-the-gift-of-the-magi", "http://www.goodreads.com/book/show/441049.The_Celebrated_Jumping_Frog_and_Other_Stories", "http://www.goodreads.com/book/show/1153622.Ten_Great_Mysteries", "http://www.goodreads.com/book/show/70791.To_Build_a_Fire_and_Other_Stories", "http://www.goodreads.com/book/show/823068.Shh_We_re_Writing_the_Constitution", "http://www.goodreads.com/book/show/6262281-gulliver-s-travels-and-other-writings", "http://www.goodreads.com/book/show/47061.Twice_Told_Tales", "http://www.goodreads.com/book/show/918786.A_Study_in_Scarlet_The_Hound_of_the_Baskervilles", "http://www.goodreads.com/book/show/509094.Legend_Of_Sleepy_Hollow_and_Rip_Van_Winkle", "http://www.goodreads.com/book/show/499225.Nine_Days_to_Christmas", "http://www.goodreads.com/book/show/143510.Five_Great_Short_Stories", "http://www.goodreads.com/book/show/12125412-the-lady-or-the-tiger", "http://www.goodreads.com/book/show/179073.The_Open_Boat_and_Other_Stories", "http://www.goodreads.com/book/show/48196.Collected_Stories", "http://www.goodreads.com/book/show/17544.The_Quiet_Little_Woman", "http://www.goodreads.com/book/show/34058.Plain_Tales_from_the_Hills", "http://www.goodreads.com/book/show/1005670.Fifty_Great_Short_Stories", "http://www.goodreads.com/book/show/559267.The_Small_Assassin", "http://www.goodreads.com/book/show/143534.The_Gift_of_the_Magi", "http://www.goodreads.com/book/show/14469.Selected_Stories", "http://www.goodreads.com/book/show/963839.The_Ransom_of_Red_Chief", "http://www.goodreads.com/book/show/14467.The_Best_Short_Stories_of_O_Henry", "http://www.goodreads.com/book/show/213395.The_Last_Leaf"]}