{"ratings": 198, "userreviews": [{"userName": "Elizabeth", "userReviewDate": "Sep 02, 2010", "userURL": "http://www.goodreads.com/user/show/717971-elizabeth", "userReview": "this has always been my favorite of Robert Westall's books, but I didn't appreciate it in as much *wholeness*, reading on and off and knowing what was coming, as I did the first time I read it.I have, happily, managed to put my hands on the review I wrote when I first read this book in 1992, and here 'tis.  A bit long-winded and full of spoilers!-------------------------I'm on page 10 and I'm already in tears.  That, I think, is a sign of great writing: because I don't yet know or understand this character, I don't know the people or things he's lost, but I've obviously sympathized/empathized with him so *instantly* that I can feel emotional about it all.[Later] Very episodic.  Harry is bombed out, loses his entire family, and rather than be taken in by smothering Cousin Elsie he strikes out on his own.  Right in the beginning he meets a bombed-out dog who becomes his protector and closest companion.  He begins by living under a boat on the beach at Newcastle for a few days, and eventually works his way up the coast to Lindisfarne--living hand to mouth, making it.[After making a list of the book’s incidents] I discovered a very interesting thing.  I was trying to remember a character’s name, and realized she doesn’t ever identify herself as anything but “the Mermaid”--her father’s old name for her.  There is another character in the book who is actually named Merman.  Both characters are after Harry’s affection, the touch of his youth, brightness, attention.  The Mermaid’s “seduction” works in a different way from Merman’s (which is overtly sexual), but Harry does lift her up, eat her food, sleep in her bed wearing her son’s clothes.  It’s like he’s always seduced by the sea--the sea creatures keep coming at him as he makes his way along the shore--and they’re always dangerous, and if he listens to the siren’s song he’s always on the verge of drowning, of getting in over his head.Which happens *literally* on his way back from Lindisfarne (where he has a bad run-in with local kids and, in the absolute cold blood of necessity, deliberately and consciously breaks a kid’s ankle), when Harry’s caught by the tide, soaked to the skin, and ends up spending the night in a refuge tower in the middle of the flooded causeway.And check this out--after his fight with the sea itself, which he wins (gets himself and his dog safe into the tower), it says: “The very air he breathed was full of salty spray, so that he breathed a mixture of air and water, half boy, half fish.”He’s turned into a merman himself!  And sure enough, the next character he ends up with--Mr. Murgatroyd--Harry asks directly, “Can I help?”  Expecting seduction of some kind, but this time he’s prepared for it.  And Mr. M. says, “Help?  Help with what?”  So Harry’s taken the offensive and offered his services--it turns out that what he’s needed for now is to be a substitute son--and Harry wins over the locals himself to work out the kinks in the plan.  He ends up spending the rest of the summer there.Mr. M wants to adopt him, so they go back to Newcastle to work things out--and discover that Harry’s family completely survived the bombing, but were tossed by the blast into the neighbor’s yard so the wardens thought they were a different family.  You think this is a happy ending, the great reunion?  There’s a twist.Dad says, “A big lad like you, running away?”Dulcie, the sister says, “And you weren’t even *scratched*…Cowardy cowardy custard.”Harry thinks of “his whole kingdom, that he’d found himself, made for himself.  And on the other side, these shabby angry bossy people… full of whining self-pity for what *they* had suffered.  Narrow, narrow…”So Mr. M. drives away with the dog and leaves Harry to his family, where he’ll have to “keep his own mouth shut, over all the years… before he got back to his kingdom by the sea.”But you know he will, because he’s amphibious now--he can live in the water *or* on the land.-------------------------------------Reading this book again nearly 20 years later, I find the narrow-minded reception of his return to his family to be a little too forced.  But it’s still a great book.------------------------------------Tori:  Lindisfarne is Windy Isle--this book was my first encounter with the Northumbrian coast!  And now I have climbed around in the WWII ruins  where Harry hides out on the beach."}, {"userName": "Snail in Danger (Sid) Nicolaides", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/125150-snail-in-danger-sid-nicolaides", "userReview": "[Boy's house is destroyed in an air raid; he thinks his family is dead.  Then at the end he finds out that they're not and they put him down for running away because he was in shock and being safe and healthy while they were in the hospital in an air raid. (hide spoiler)]"}, {"userName": "Cheryl", "userReviewDate": "May 04, 2011", "userURL": "http://www.goodreads.com/user/show/1976749-cheryl", "userReview": "[malicious pedophile grooming a potential victim, child on child violence, abusive behavior by cruel parents (hide spoiler)]"}, {"userName": "Heather Browning", "userReviewDate": "Jul 16, 2013", "userURL": "http://www.goodreads.com/user/show/5900232-heather-browning", "userReview": "A gorgeous book, genuinely moving and sweet. The characters, both good and bad, are subtle and realistic. Though the book is aimed at young adults, Westall doesn't patronise or shy away from more adult ideas, and for this reason, I found it still spoke to me, despite being many years outside the target audience. He doesn't try to lead the reader with absolutes, but plays the events and themes with ambiguities, particularly the ending - the supposed 'happy' ending unable to be just that after everything Harry's experienced. Highly recommended."}, {"userName": "Mitchell", "userReviewDate": "Jun 22, 2014", "userURL": "http://www.goodreads.com/user/show/8859907-mitchell", "userReview": "The first novel I ever read. Intensely emotional for a young teenager. I could relate intimately to the pivotal character - with his youthful perspective on the world and people around him. His situation of loneliness in a war ravaged Britain, poses a challenge for the character and reader combined - such is Westall's ability to make you feel like you are with the protagonist at every page. When on a worrisome walkabout once, I almost slept under an upturned boat just like the character (I found a warmer hostel...) Still got the original publication. A very sentimental possession this book; the end is a spoiler in itself and makes it a book you will never read twice but always savour."}, {"userName": "Linda Lipko", "userReviewDate": "Nov 25, 2014", "userURL": "http://www.goodreads.com/user/show/1544522-linda-lipko", "userReview": "A wonderful coming of age book regarding a twelve year old Enlgish boy whose house and family were bombed during WWII.  While initially traveling alone,  he finds a dog and both  bond and search for a sense of belonging and a place to call home. Before finding their Kingdom by the Sea, they face many difficult situations.This beautifully written gem is an incredible book.  Once again Westall's young adult book deals with very heavy topics and leaves the reader in awe of his ability to search the soul and clearly identify human emotions."}, {"userName": "Peachperfect", "userReviewDate": "Aug 05, 2013", "userURL": "http://www.goodreads.com/user/show/21150171-peachperfect", "userReview": "I hated this book, and there aren't many books that I hate. This book, right from the start, has been an absolute horror. I found it really hard to get into this book, and when I did, I wasn't worth it. To the people who like this book, I'm sorry for being so ruthless, but by the quality of this book, there aren't that many. It's hard to describe why I don't like this book, but there is one that stands out like a sore thumb: the ending. The ending, I felt, was rushed and untidy. It felt as if the author had to finish the book in a hurry, couldn't think of any way to, so wrote a couple of words, slapped a stamp on it and then sent it to be published. Another thing that I didn't like was the character himself. He seemed to be a cold hearted robot. One thing that I DID like was Don. So, in total, I hated this book, and I would recommend it to nobody."}, {"userName": "Kyle", "userReviewDate": "May 29, 2011", "userURL": "http://www.goodreads.com/user/show/2409338-kyle", "userReview": "This is a coming of age story about a boy and his dog, set in the north of England during WWII. Harry's adventure along the coast is fraught with challenge after challenge, and it seems that everyone he meets is two shades shy of normal. This is a bleak and flawed landscape, filled with people we fear, people we pity, people we would likely avoid. Harry pushes on with a wisdom well beyond his years, even as his country fights for its own existence. It is how he chooses to combat all these challenges, and overcome his own weaknesses that make this book well worth reading, for children and adults."}, {"userName": "Sonia", "userReviewDate": "Jul 27, 2011", "userURL": "http://www.goodreads.com/user/show/3068937-sonia", "userReview": "Excellent story of a young boy's survival after his family's home is bombed.  Written as a children's story, it has some very dark and seriously unpleasant scenes, especially the ending. Some people may find this book to be inappropriate for children but today's middle- school-aged children have heard it all and should be able to handle it. I'm hoping to find more books by this author (especially some of his many \"cat\" books).This was the audio version of the book and the narrator, Ron Keith, was very good."}, {"userName": "Ankit", "userReviewDate": "Jul 01, 2013", "userURL": "http://www.goodreads.com/user/show/18994829-ankit", "userReview": "I didn't really like this story. It had a predictable story line 'Boy loses his parent and ends up finding refuge'. Harry is a 12 year old boy who 'loses' his parent and ends up finding a dog who accompanies him in his journey. Harry finds people who help him through his journey. At the end of the novel Harry finds his parents and they get angry at him for leaving the town that got bombed. I really didn't enjoy the ending, the overall book was ok, but the ending ruined it for me."}, {"userName": "Henry", "userReviewDate": "Jun 22, 2009", "userURL": "http://www.goodreads.com/user/show/2448136-henry", "userReview": "The Kingdom by the Sea was a wonderful book combining my three favorite styles of survival story. Wilderness Survival: your basic garden variety rough it style, urban survival: saving, buying, and, packing to make ends meet, and mid ground survival with no place to go using both styles to live."}, {"userName": "Livvy", "userReviewDate": "Sep 13, 2012", "userURL": "http://www.goodreads.com/user/show/11134731-livvy", "userReview": "This book is great - I mean it's fun to imagine living by the sea, and it's written well, and interestingly. But what is with the ending? It defeats the point of the whole book, and decreased the value of a previously great book for me. But other than that, I really liked it."}, {"userName": "NC", "userReviewDate": "Nov 17, 2012", "userURL": "http://www.goodreads.com/user/show/6879879-nc", "userReview": "This wonderful book has me out looking for the rest of this author's books. A wonderful adventure of a boy and his dog during WWII. Terrific growth in the character and a realistic ending. I wish there was a sequel, though the ending is very satisfying."}, {"userName": "Varsha Seshan", "userReviewDate": "Nov 15, 2012", "userURL": "http://www.goodreads.com/user/show/8694105-varsha-seshan", "userReview": "Sophie McKenzie is absolutely right when she says that Westall chose a third ending altogether! I enjoyed the book tremendously. The range of characters is incredible; the relationships drawn are beautiful."}, {"userName": "Naderah", "userReviewDate": "Jul 27, 2012", "userURL": "http://www.goodreads.com/user/show/9289912-naderah", "userReview": "FINALLY FINISHED.I can't say much about the ending. I pity the main character though. I wished there was a better ending but this is a bit of a realistic book. We can't always have a happy ending."}, {"userName": "Tilli", "userReviewDate": "Sep 28, 2013", "userURL": "http://www.goodreads.com/user/show/16620739-tilli", "userReview": "Read this a few years ago for school so I can't remember much about it, although from what I do remember it was a good book and I did enjoy it, and I most probably will re-read it."}, {"userName": "Nikki", "userReviewDate": "Jun 05, 2008", "userURL": "http://www.goodreads.com/user/show/223837-nikki", "userReview": "I always loved this book, and imagined I would kind of like an adventure like this -- if I knew my parents and sister were safe at home."}, {"userName": "Margareth8537", "userReviewDate": "Sep 16, 2013", "userURL": "http://www.goodreads.com/user/show/19918232-margareth8537", "userReview": "Might have found this a bit difficult when younger, but many of today's young teens could cope.Very evocative of the period"}, {"userName": "Joshua", "userReviewDate": "Feb 15, 2011", "userURL": "http://www.goodreads.com/user/show/3694125-joshua", "userReview": "like \"Once\" by Morris Gleitzman so I will recommend to the year 7's and 8's"}, {"userName": "Katherine", "userReviewDate": "Jul 22, 2012", "userURL": "http://www.goodreads.com/user/show/10566513-katherine", "userReview": "My favorite childhood book! A beautiful story."}, {"userName": "Louisville_Loft", "userReviewDate": "Jan 27, 2010", "userURL": "http://www.goodreads.com/user/show/2161751-louisville-loft", "userReview": "Boulder"}], "description": "Twelve-year-old Harry struggles to make it on his own after his family is lost in a German air raid. But as he and his dog companion journey along the northern English coast, there is never enough distance between them and the terrible war.", "title": "The Kingdom by the Sea", "url": "http://www.goodreads.com/book/show/72212.The_Kingdom_by_the_Sea", "average": 4.02, "cover": "http://d.gr-assets.com/books/1170806161l/72212.jpg", "reviews": 21, "authors": [{"url": "http://www.goodreads.com/author/show/7163.Robert_Westall", "name": "Robert Westall"}], "outlinks": ["http://www.goodreads.com/book/show/8721083-the-kingdom-by-the-sea-robert-westall", "http://www.goodreads.com/book/show/18481506-la-grande-avventura", "http://www.goodreads.com/book/show/8721083-the-kingdom-by-the-sea-robert-westall", "http://www.goodreads.com/book/show/8721083-the-kingdom-by-the-sea-robert-westall", "http://www.goodreads.com/book/show/8721083-the-kingdom-by-the-sea-robert-westall", "http://www.goodreads.com/book/show/476814.My_Neighbor_Totoro_Picture_Book", "http://www.goodreads.com/book/show/257750.Cuckoo_in_the_Nest", "http://www.goodreads.com/book/show/1141108.The_War_of_Jenkin_s_Ear", "http://www.goodreads.com/book/show/439597.Spider_Man_3", "http://www.goodreads.com/book/show/56324.When_the_Soldiers_Were_Gone", "http://www.goodreads.com/book/show/744175.Words_By_Heart", "http://www.goodreads.com/book/show/1579906.Street_Child", "http://www.goodreads.com/book/show/3744599-the-faerie-door", "http://www.goodreads.com/book/show/1038268.Slake_s_Limbo", "http://www.goodreads.com/book/show/130203.The_Friendship", "http://www.goodreads.com/book/show/259066.Lupita_Manana", "http://www.goodreads.com/book/show/13436366-third-grade-angels", "http://www.goodreads.com/book/show/10181349-metallic-dreams", "http://www.goodreads.com/book/show/1175278.Lavender_Leigh_at_the_Chalet_School", "http://www.goodreads.com/book/show/915840.Ida_Early_Comes_over_the_Mountain", "http://www.goodreads.com/book/show/13498930-adventure-time-with-finn-jake", "http://www.goodreads.com/book/show/827276.Travel_Light", "http://www.goodreads.com/book/show/1626753.Where_I_Live", "http://www.goodreads.com/book/show/10963.The_Machine_Gunners", "http://www.goodreads.com/book/show/402126.Blitzcat", "http://www.goodreads.com/book/show/795182.Scarecrows", "http://www.goodreads.com/book/show/2721990-the-cats-of-seroster", "http://www.goodreads.com/book/show/1975160.Futuretrack_5"]}