{"ratings": 4639, "userreviews": [{"userName": "Vanda", "userReviewDate": "Sep 20, 2008", "userURL": "http://www.goodreads.com/user/show/1150480-vanda", "userReview": "i couldnt put the book down since the first time i touched it. i couldnt believe that this book is a children book, seriously?in my humble opinion i would say this is an adult book written by an adult to the world of adulthood. all of the children instruments in there are only symbols and mediums of the idea being presented.anyway,the book has tamed me, just like the boy has tamed the fox or the rose has tamed the boy (without him realizing it). There are so many wonderful books out there but this one is too beautiful to just see it as one among so many...because the book has tamed me so that i can see it's uniqueness stands out in all the vast expanse of my universe of books...Exupéry has depressed me, somehow. Reading it made me feel regretful, like i owed many people a second glance. The book has a gloomy message not because of the ending or anything to do with it but i think the writer was lonely and he transported that loneliness to me, the reader...It made me regret the things i havent done that i should have done...i missed the things i have tamed and have tamed me and that i have just ignored them as something like a roadkill, dropped somewhere along the way and never reckoned a second glance. I should have read this book long ago...things would have been different, wouldnt them?some great quotes from the book: \"you can only see things clearly with your heart. What is essential is invisible to the eye\"\"it is the time that you wasted on your rose that makes your rose so important\""}, {"userName": "Andy", "userReviewDate": "Nov 14, 2011", "userURL": "http://www.goodreads.com/user/show/1251066-andy", "userReview": "I picked this up after finding myself in Queenstown with two hours to kill and nothing to read.  I had never heard of it before but the children's book in the Penguin Modern Classic format intrigued me.The resulting fable for children, plays as a warning to the adult to retain that wonder of the world that keeps us grounded, reminding us of the real magic and importance of life.  The adult world is mocked and ridiculed, wrapped up with figures, pomposity, ceremony and self absorption, as we meet the Little Prince and uncover his journey around the galaxy, encountering strange people living their own strange lives.  All while trapped in the desert.It's an odd and affecting story, rather melancholy in tone and infused with loneliness and a sense of isolation from the world and people around.  There's a magical underbelly, some wonderfully clear prose (translated from the French) and self mocking illustrations to set the scene.The tale is complemented by 'Letter to a Hostage', penned to his intellectual friend during the second world war.  It's an evocative read, sad yet hopeful.Overall, a lovely and well presented little book.  Worth having tucked away on your shelves somewhere for the future."}, {"userName": "Jen", "userReviewDate": "Feb 06, 2009", "userURL": "http://www.goodreads.com/user/show/1975074-jen", "userReview": "I read this book in the course of a couple of hours when I was a junior in high school.  My sister and I had both studied French, and her teacher had recommended it.  My sister asked me once during a conversation if the sheep had eaten the flower.  Having no idea what she was talking about I ignored the question and thus became a grown up.  Horrified by my answer, my sister handed me the book and told me not to move until I had finished it.  I read it, and once I was allowed to move I looked out my front window at the night stars and realized how such a simple question could be a matter of so much importance.  I still find myself wondering sometimes if the little prince has remembered to put the muzzle on the sheep and the glass over the flower, and I see how everything changes.  My view of life changed because of the little prince, his peels of laughter, and his childish need to ask certain questions but not answer others.  I have been comforted many times by this book and its uncanny ability to make me forget about even the most difficult things in life and see the world again through the eyes of a child.  If you haven't read this book, then you must.  It will only take a few hours of your time, but it will give you the world if you let it.  Enjoy."}, {"userName": "Sherouk.Salah", "userReviewDate": "Jun 09, 2013", "userURL": "http://www.goodreads.com/user/show/6934237-sherouk-salah", "userReview": "After six months, I sigh! OMG, I dropped tears, I shocked losing him here, never answer a question and never let a question to go, and I am n miss with The Little Prince.The novel is like a magic, if you are just 5 years old you will deeply enjoy your mum reading you a chapter every night with her kind voice and your imagination is fulfilling you while you looking to the stars.If you are 25 –like me- you will touch the wisdom, the deepness, and that sweety pain while you are looking to the star and listen to the laughter!The Novel is more than 25 chapters lie in few papers; it is the wisdom of life concluded professionally with the whole simplicity that ever exists.It touches deeply the child inside me and gave me hope to be better, more realizable, less talkie, much appreciator to people.It gave me the proof that I was right in many thoughts while others kept calling me stranger.You can tame a fox one day, and you shall have the enough strength to show the grown-ups how taming foxes is great!I dream of being there in African desert one day, I will go to that spot, looking for him. If he comes again I will write you a word, and if not I will never stop looking at the stars and listen to the laughter. The experience of having the pleasure reading it in six months is different. I was keeping it as having a hidden piece of sweet no to eat it but to know that when life is very bitter, there is something extraordinary sweet you already own, which is a good reason to smile.It deserves to be kept, reading it chapter by chapter when the surroundings deserve the feeling you will spread. Early mornings; near a window while ice is everywhere outside, and it is only you with a hot cup of coffee. While you are setting alone on the train and the long road is running outside.I really enjoyed reading it in winter and spring.Sherouk M. Salah08.06.13. Leverkusen, Germany"}, {"userName": "Joany Vries", "userReviewDate": "Jan 12, 2015", "userURL": "http://www.goodreads.com/user/show/10809522-joany-vries", "userReview": "Al sinds ik als meisje voor het eerst de film zag van The Little Prince wilde ik het boek lezen en - zoals wel vaker het geval is - heup boek is zelfs nog beter. Wellicht een beetje te grimmig voor een kinderboek, maar door de mooie vergelijkingen en metaforen ook zeker heel geschikt voor volwassenen."}, {"userName": "Malbadeen", "userReviewDate": "Feb 01, 2009", "userURL": "http://www.goodreads.com/user/show/128745-malbadeen", "userReview": "A didactic tale full of syrupy analogies that rely on appeal to sentiment more than great writing."}, {"userName": "Kátia Cristina", "userReviewDate": "Nov 30, 2014", "userURL": "http://www.goodreads.com/user/show/24357190-k-tia-cristina", "userReview": "This is the 4th time I read The Little prince and I never get tired of it. On the contrary I understand it and its beauty much better after each rereading."}, {"userName": "Nini", "userReviewDate": "Jan 13, 2015", "userURL": "http://www.goodreads.com/user/show/39069068-nini", "userReview": "I simply have to start this book review with a personal anecdote. October 28th 2010, at the age of 37, I find myself with a co-worker at a conference in Barcelona, Spain, listening to a keynote speaker presenting her research and starting by showing a slide depicting a big brown hat. Obviously the audience, including my co-worker and excluding myself, knew what this was all about. Not only did I feel uncultured for not knowing about the reference made to this famous children's book, but I surely felt narrow minded for not seeing that the slide was depicting an elephant digesting a boa constrictor and not a hat.How I can explain that I hadn't read this children's book? I did not grow up in a reading family, the book wasn't included in the school's curriculum, I didn't read voluntarily before the age of 13-14 and by then I was interested in teenage reading stuff, etc. As a reading mum and as a reading person writing book reviews, I still cannot explain this gap. But now, back to the anecdote...October 14th 2013, i.e. almost exactly three years later, my youngest sister posted a Facebook update depicting the Little Prince on her newly bought cup. This time I knew about the hat, i.e. the boa in the elephant, and made a reference to it. Yes, I was no longer uncultured as I had learned my lesson well, I had even bought the book. But as honesty lasts the longest, I had to admit to myself I still hadn't read the book.So, October 2013, I finally started to read this children's book and I haven't regretted it yet. In this stage of life, I feel gratitude for reading the book for the first time as an adult, as I read it as a many levelled and almost philosophical adult book rather than a children's book. I wasn't probably mature for it until now, one could say. And now the book has highlighted passages, words, sentences and situations for me to easily get back to.There are two (for me) most precious parts in the book: the one is the chapter when The Little Prince meets the fox and they discuss friendhip and happiness. The other part is the final chapter that has a direct link to the chapter with the fox and where The Little Prince leaves his legacy to his friend, to the reader, to the world.This extract might be illuminating:-- \"I cannot play with you,\" the fox said. \"I am not tamed.\" [...] \"I am looking for friends. What does that mean--'tame'?\" (asks the little prince) \"It is an act too often neglected,\" said the fox. It means to establish ties.\" [...] \"Just that,\" said the fox. \"To me, you are still nothing more than a little boy who is just like a hundred thousand other little boys. And I have no need of you. And you, on your part, have no need of me. To you, I am nothing more than a fox like a hundred thousand other foxes. But if you tame me, then we shall need each other. To me, you will be unique in all the world. To you, I shall be unique in all the world . . .\" [...] \"My life is very monotonous,\" the fox said. \"I hunt chickens; men hunt me. All the chickens are just alike, and all the men are just alike. And, in consequence, I am a little bored. But if you tame me, it will be as if the sun came to shine on my life. I shall know the sound of a step that will be different from all the others. Other steps send me hurrying back underneath the ground. Yours will call me, like music, out of my burrow. And then look: you see the grain-fields down yonder? I do not eat bread. Wheat is of no use to me. The wheat fields have nothing to say to me. And that is sad. But you have hair that is the color of gold. Think how wonderful that will be when you have tamed me! The grain, which is also golden, will bring me back the thought of you. And I shall love to listen to the wind in the wheat . . .\" [...] \"I want to, very much,\" the little prince replied. \"But I have not much time. I have friends to discover, and a great many things to understand.\" [...] \"One only understands the things that one tames,\" said the fox. \"Men have no more time to understand anything. They buy things all ready made at the shops. But there is no shop anywhere where one can buy friendship, and so men have no friends any more. If you want a friend, tame me . . .\" [...] So the little prince tamed the fox. And when the hour of his departure drew near. \"Ah,\" said the fox, \"I shall cry.\" \"It is your own fault,\" said the little prince. \"I never wished you any sort of harm; but you wanted me to tame you . . .\" \"Yes, that is so,\" said the fox. \"But now you are going to cry!\" said the little prince. \"Yes, that is so,\" said the fox. \"Then it has done you no good at all!\" \"It has done me good,\" said the fox, \"because of the color of the wheat fields.\" [...] \"Goodbye,\" he said. \"Goodbye,\" said the fox.\"And now here is my secret, a very simple secret: It is only with the heart that one can see rightly; what is essential is invisible to the eye.\" [...] \"Men have forgotten this truth,\" said the fox. \"But you must not forget it. You become responsible, forever, for what you have tamed.\" --I recommend you to read or to reread this book as an adult!/by nini"}, {"userName": "Susannah", "userReviewDate": "Mar 16, 2009", "userURL": "http://www.goodreads.com/user/show/343452-susannah", "userReview": "I'm pretty sure this was written by a french person. Some friends of mine recommended it after they had to read it for their french class. I know I read it but can't remember a thing about it. It left quite the impression didn't it. ha ha"}, {"userName": "Dodi Prananda", "userReviewDate": "May 07, 2014", "userURL": "http://www.goodreads.com/user/show/14783338-dodi-prananda", "userReview": "Membaca buku ini, aku rasanya ingin menghadapi dunia dengan cara berpikir anak-anak. Dengan begitu, dunia menjadi mudah, jauh dari kesan rumit. \"Orang dewasa menyukai angka-angka, tapi tentu saja kita yang memahami hidup, sama sekali tidak memedulikan angka-angka. Begitulah mereka! Kalian tidak usah menyesali mereka. Anak-anak mesti berbesar hati terhadap orang dewasa,\" tulis Antoine.Terima kasih Antoine, untuk perenungan yang mendalam ini, yang kau tulis sesederhana itu, dan cerita itu disampaikan selugu dan sepolos pikiran anak-anak. Dalam pengasingan dan kesedihan, mahakarya ini justru lahir."}, {"userName": "Mihaela Sorlea tentis", "userReviewDate": "Apr 29, 2013", "userURL": "http://www.goodreads.com/user/show/12623374-mihaela-sorlea-tentis", "userReview": "enchanting - a book for grown ups definitely."}, {"userName": "Olivia", "userReviewDate": "Jun 10, 2012", "userURL": "http://www.goodreads.com/user/show/2340759-olivia", "userReview": "I heard people raving about this book and I completely understand why!\"The Little Prince\" is centred on a little prince who leaves the safety of his own tiny planet, embarks on an 'intergalactical' journey and experiences interesting encounters with grown ups in different planets. His story is narrated in his conversation with an aviator he met who made a forced landing due to engine failure in the Sahara dessert - a place, that is often portrayed as lonely, sad place where life will meet its end, is interestingly chosen to be the place of birth of enlightenment and connection. Combining innocent, honest and imaginative storytelling style with premise that rings true with what human always longs for, \"The Little Prince\" possesses an everlasting charm.\"The Little Prince\", through several types of grown up living in their own small 'planets', presents us anecdotes of grown ups' desire and banalities seen through innocent eyes: greed, narcissism, quest for power, wisdom without real action, conformity without questioning. It begs us to question what growing up is all about - have we lost sight to what is important to conform with society's expectation?In a more essential level, The Little Prince reminds us about the importance of human connection and how we need it and are responsible to nurture it once it is formed. Connection is built through efforts and moments together. It is so personal that no one can fully grasp it unless you are the subject of that connection. Letting one's guard down, the courage to experience, be it happiness, longing, suffering, loss or grief - that is what stops our lives from being like a machine. It may not be perfect and has its own problem but it makes our lives meaningful. Although this book was published a long time ago (1943), this book couldn't be more relevant for today's age. In today's age that puts premium and value things based on tangible achievements and outlook, we often forget that \"... you can only see things clearly with your heart. What is essential is invisible to the eye.\"\"The Little Prince\" is not just a children book. It is a book that everybody should read, especially grown ups and is definitely one of the books that I will revisit time after time."}, {"userName": "Romain", "userReviewDate": "Nov 28, 2013", "userURL": "http://www.goodreads.com/user/show/8933065-romain", "userReview": "The Little Prince is the tale of an airman, whose plane crashes in the Sahara desert. As he sets about trying to repair his plane, he meets the little prince: a visitor from a tiny planet, who fell to Earth. The little prince is special because he has the eyes and heart of a child. His world is a world of both acceptance and curiosity, understanding and ignorance, and of the simple redemption of laughter.The charm of this fable is remarkable because it possesses an emotional and resonant core that uses the formal elements of the children's story to house the relationship (or lack of) between adults and children. What better way to understand the world of adults than by the questions of a child. Through the honey-laced hollows of nostalgia, his eyes perceive something that feels... truthful. To unravel the complicated adult rules and systems of value in the journey of the little prince is to wonder if we know anything at all.Antoine de Saint-Exupéry sprinkles the story with a series of illustrations that enhance the words and ideas, beautifully drawn and completely unique. An enchanting little book."}, {"userName": "Jaeyoung Chun", "userReviewDate": "Dec 13, 2012", "userURL": "http://www.goodreads.com/user/show/12709137-jaeyoung-chun", "userReview": "The book I read is named 'The Little Prince and Letter to a Hostage' by Antoine de Saint-Exupery.This book is about a pilot who fell down to the desert and met the Little Prince. The Little Prince is the guy who lives in one planet with a rose.The rose said that it is the only one in the universe. So the Little Prince travels the planets to prove that the rose is wrong. He meets many adults and is disappointed about the adults. He fell down to the desert in the Earth and met a snake, a fox, and a person. He also found roses on the wall. The pilot and the Little Prince criticize the adults' attitudes toward them. My favorite part of this book is when the Little Prince meets the snake. It is because the snake gives a little help to the Little prince and the Little Prince find the answer to make the rose happy. I think author was trying to tell the difference of adult and children. I connected with this book because I strongly agree with the Little Prince  What I learned in this book is that you can get help from somebody else to solve a problem. I learned because the snake helped the Little Prince to solve his problem by answering his questions and teaching the Little Prince that there are many creatures they are same. I don't recommend this book because this book doesn't really show the specific ending."}, {"userName": "Gary", "userReviewDate": "May 19, 2013", "userURL": "http://www.goodreads.com/user/show/12412766-gary", "userReview": "While the story itself can be a little reliant on sentiment to make us feel for the little prince, it is written with such delicate fragility and tender sincerity that when pitted against the metaphors for heavier subjects of existence, The Little Prince elevates itself from just being another sentimental story of lost childhood and innocence. The drawings are a unique feature of the story and serve as excellent and creative devices that really brings the story to life and inspires a greater level of imagination and wonder in the reader. The closing passage, complemented with the drawing of a lone star in the desert sky, has got to one of the most simple and poignant closures of a story I've ever read. Letter to a Hostage is a very optimistic and humanistic read that explains in greater detail (and poetry) to adults who \"often need much explaining\". When included with The Little Prince, Antoine brings a firmer and more pressing context to The Little Prince, yet retaining much of it's innocent pleas for peace and human solidarity in the looming cloud of World War Two. Everyone should read this book."}, {"userName": "Sheenin", "userReviewDate": "Nov 11, 2012", "userURL": "http://www.goodreads.com/user/show/6104523-sheenin", "userReview": "I found this book fascinating and meaningful. Although it is not one of my favourite books, it is still one of the books that will always stay in my mind. \"The little prince\" describes how children, from a baby to a 12-year-old, are often misunderstood by adults. In this story, the author told me his opinions about adults. In page 7, the author said, \"I would place myself on their level. I would talk about bridge and golf, about politics and neckties. And the grown-up would be very pleased to have made the acquaintance of such a sensible fellow.\" His meaningful opinion had always stayed in my mind after I read it. He thinks that adults only like children who are \"sensible\" and will talk about those kind of topics, rather than talking about toys and drawings. On the other hand, the book was fascinating because it describes the journey of the little prince when he travelled around the \"world\" and met all kinds of people, from a drinker to a lamplighter. The choice of words and its illustrations had allowed me to imagine how the people had looked like. The characters, settings, and plots of the story were quite unique and peculiar. This is one of the reason why this book will always stay in my mind."}, {"userName": "Caroline Turla", "userReviewDate": "May 09, 2011", "userURL": "http://www.goodreads.com/user/show/4066670-caroline-turla", "userReview": "This book was heartwarming and entertaining. It was heartwarming because it gives lesson to people who will surely read it. The biggest difference between the adult and children which was like gave me the disapproval of myself being grown up. Well, the book speaks the lessons about life that have been spoken but haven't been apply. You know the difference about truth and reality. The possibilities that there really are people or royalty from different planets or asteroids.Yet it was entertaining because of the drawings. When I read this book, every pages makes me curious about the story. Until the end, my heart was feed with thoughts and understanding. I felt sympathy for the little prince. I just wanna carry him like what narrator done. I just wanna hug him and tell him that it's ok to stay with me and we learn lessons together. Until the end I was so close coming to Sahara by myself and go to the spot that have been drawn to check if I can see the little prince by myself and see if he's still alive. (Stupid of me)But in the end, I learned that we people, we teens, adults, grown ups or whoever never care what the children knows and act as if we know everything that we are smarter than them. That what they are seeing cannot be compared on what we saw. We always thought that what we saw or learned is more important than what the children knows. You know, sometimes children see things that we cannot see. Sometimes, what they have thought are closer to reality than our logical reasoning can do. Sometimes children are right with everything. :l"}, {"userName": "Phil Call", "userReviewDate": "Jul 17, 2013", "userURL": "http://www.goodreads.com/user/show/22281119-phil-call", "userReview": "The Little Prince is the story of a boy who lives on a small planet far away and meets a stranded pilot in a desert. Throughout their time in the desert as the man is trying to survive, they have many interesting conversations and convey thoughtful points. The book is sprinkled with simple yet enjoyable drawings that add to the mysterious ambiance of the book. I can't recall exactly when I read this book for the first or second time - some time in high school probably - but I thoroughly enjoyed it for the simple delights of creative story-telling it involves as well as its insights about life. Here are a few fun excerpts:“It is the time you have wasted for your rose that makes your rose so important.”...“All grown-ups were once children... but only few of them remember it.” ...“People where you live,\" the little prince said, \"grow five thousand roses in one garden... yet they don't find what they're looking for...They don't find it,\" I answered.And yet what they're looking for could be found in a single rose, or a little water...\"Of course,\" I answered.And the little prince added, \"But eyes are blind. You have to look with the heart.”"}, {"userName": "Brenda", "userReviewDate": "Dec 14, 2013", "userURL": "http://www.goodreads.com/user/show/20017390-brenda", "userReview": "This has been my favorite book for a very long time for too many reasons. First off its so honest and I'm not sure if its the childlike wonder and naïveté of the little prince or his wisdom that captivates me so much. He's this contradictory being where his demeanor shows that he knows nothing and is learning how the world works though a toddler's mind, but somehow just UNDERSTANDS. He sees things and he doesn't quite connect or relate to why things are the way they are but he understands them. Being this alien thing that's never been on earth, one would expect him to be so different from the average person but the most endearing thing I find in this book is how human he becomes when he-- like most of us, finds himself in such a heartbreaking but awe-striking circumstance in the presence of what he learns to be love. This book can be described as so many things but ultimately, what makes it so timeless is the way the most complex realities of life are depicted so simply in an intricate way. Don't ask how, as I've mentioned before, this book was such a contradiction to me but its like looking in the mirror and what person in the history of ever hasn't been simple and complex at the same time? This book reminds us that we were all children at one point and deep down, regardless of who we paint ourselves to be, there's still that small child we were lurking somewhere in out hearts. So in conclusion, I really fucking like this book-- and that's an understatement."}, {"userName": "Sophie", "userReviewDate": "Sep 06, 2013", "userURL": "http://www.goodreads.com/user/show/7250047-sophie", "userReview": "[ended with a snake biting the prince, bringing it full circle - what looked like death to the outside world that couldn't understand was life to the prince and the narrator. (hide spoiler)]"}, {"userName": "Nurul", "userReviewDate": "May 06, 2010", "userURL": "http://www.goodreads.com/user/show/3055335-nurul", "userReview": "It's impossible to see the world of adulthood through the lens of the little prince without experiencing a certain change of perspective. I've been told before that The Little Prince is a book for children, and while that's true, it's also clear that such moral allegory surely was intended for grown-ups. Complete with bright, child-like drawings that one would have to be soulless to dislike, The Little Prince is a charming tale that should be read by everyone, especially those on the cusp of adulthood like myself as a daily reminder of sorts. The story unfortunately paints an accurate tableau of grown-ups. One of my favourite parts would be the little prince's depiction of The Conceited Man. The exaggerated description (which is fitting, considering the fact that this was told by a child, even if he is an unusual child) rather tickled me. Yet, it cannot be refuted that such people do actually exist in real life...I only hope that the little prince manages to find his way back home to reunite with his beloved flower."}, {"userName": "Deska", "userReviewDate": "Feb 23, 2013", "userURL": "http://www.goodreads.com/user/show/9116169-deska", "userReview": "It only took me about an hour to reread The Little Prince.. Now I really do not understand why can I forget such an unforgettable story like this.. Well I have my theory why, but let's put that to rest coz it doesn't matter anymore..I would like to think that this book is dedicated to the children's side of grown-ups used to be.. it's definitely a book full of moral allegories in life.. how sometimes people are not grateful and forget what is actually important things in life.. This story mildly reminds us to those important and easily to forget things.. This book is so wonderful, written in such a wonderful story..there are many sentences that I can quote and relate in life.. it makes me happy and warm inside :) and I am more than happy to put this book on the table beside my bed so I can easily grab and read this book at any time I wish.. <3And as for the essay by Antoine; Letter to a Hostage, sadly I could not get into the story and grab the idea.. so I kinda did not finish reading it.. Although it was a very short one, about 20 pages and it has nothing to do with The Little Prince story, but still I could not get into it so... yeah.. xp-----------------------------------------------------------------------------------------I have read this book years ago. And now I don't remember anything about it.. while I was looking at my bookshelf, I was trying to remember what this book is all about.. But I just could not recall anything.. well, better I reread this and review it later on.."}, {"userName": "Carisa Vllrc", "userReviewDate": "Aug 22, 2013", "userURL": "http://www.goodreads.com/user/show/15095517-carisa-vllrc", "userReview": "I'm not sure if I ever think like the little prince, but it is only when I reread it for the third time did I understand the story completely, and I guess would require another rereading for me to take it all in. It is wonderful to the point that it will make you think and reason with yourself wondering who you portray in the story. Of course, I would want to be like the little prince, and at some point, I did happen to think like him. Asking questions and such, and receiving annoying exclamations from my parents, mostly from my dad, for asking random and stupid questions! Though I never truly stopped from asking such questions, but I did learn to control myself and minimize it even for just a little bit. It is only now that I feel proud for being too childish with my age. Because now I can say that I am like the little prince! Even though I have one of little prince's bit of character, I can also see the other inhabitants of the different planets in myself. And so I recently just thought that that is the point that we are to know in the Little Prince. That at some point of our life, we became like them."}, {"userName": "Irene Bae", "userReviewDate": "Sep 08, 2013", "userURL": "http://www.goodreads.com/user/show/17078619-irene-bae", "userReview": "I decided to read this book because my mom had recommended very strongly and this book was also one of the book you must read while you are alive. I placed this book in the \"a fantasy book\". The main character is this pilot but he mostly tells about this boy called little prince little prince tall the pilot/ narrative about his journey starting from his planet, Asteriod B-612. Human can not breath or live in another planet scientifically so, i believe this is a fantasy book. Little price told thr pilot (narraitor) about conversation he had with fox and rose and the story of little prince visiting other planet. My favourite quote was \" To me, you are still just a little boy like a hundred thousand other little boys, and i have no need of you. And you have no need of me, either. To you, i am just a fox like a hundred thosand other foxes.  But if you tame me,  we shall need one Onther. To me, you will be unique. And i shall be unique to you\". I liked this quote because this quote made me realise about people meet others and developes of their relation ship. (When they get to know each other more they become unique to each other that they mean more than any six million people in the world.) something new i learned from this book is the meaning of peoples meeting. It was a fact that i knew but did not realise before. I also liked the narrator how he was very unique from others when he was young, he was imaginative. He drew a boa with elephant inside (but everyone thought it was just a hat) i loved this read how it os very fun, unique and fresh ideas behind. I read this book in korean first then read the english version, which i loved more i give this book 5/5"}, {"userName": "Alfred", "userReviewDate": "Dec 17, 2008", "userURL": "http://www.goodreads.com/user/show/241568-alfred", "userReview": "Opened this book up and there was an inscription from my late Grandmother: \"To Ryan - My Own Little Prince.\"That's either really sweet or just makes you roll your eyes, but there it is. It added to the book's magnitude while reading it.That said, I liked The Little Prince but didn't especially understand it. I suppose this is due to some combination of the narrative being an allegory, the meaning being slightly lost in translation, and the author being French. Still, I got some of the more obvious messages of adults losing the essential reason-for-being that children inherently understand. And even when I didn't \"get\" it, my interpretations of slippery meanings were right at the tip of my subconscious. Regardless, it's amusing to think that this is somehow posited as children's literature, because I think it would take a wildly precocious child of 13 or younger to even understand the verbage.Anyway. The narrator's plane crashes in the Sahara, where he meets The Little Prince. The Little Prince is from an asteroid not much bigger than himself, and we as readers soon find ourselves magically whisked away to said asteroid. The Little Prince is, well, little, and speaks poetically, and dresses natty, with bell bottom slacks and an ever-flowing scarf.  He wants the narrator to draw a sheep with a muzzle so that it won't eat the one flower on his tiny planet. He sort of falls in love with this particular flower, which may or may not be a metaphor for a lovely yet high-maintenance woman. Before The Little Prince leaves his planet on a journey, he cleans out volcanoes with a broom and the poor flower cries at his departure....The Little Prince then travels from asteroid to asteroid. He meets a king that rules no one but immediately assumes The Little Prince is his subject. \"To [Kings], all men are subjects.\" On another planet, he meets a conceited dude. \"To conceited men, all other men are admirers.\" On another planet, he meets a drunk, aka a \"tippler.\" Here's a good bit of dialogue:Little Prince: What are you doing there?Tippler: I am drinking.LP: Why are you drinking?T: So that I may forget.LP: Forget what?T: Forget that I am ashamed.LP: Ashamed of what?T: Ashamed of drinking!The story goes on like this, in its droll and wise manner. I won't ruin any more of it for you. There are foxes and roses and snakes involved. The ending is sad, and not, and made me want to get in touch with all my \"true\" friends immediately, and get on with doing something more purposeful right away (but then that's the same with most vaguely inspiring things that I read). Overall, I was glad I read it, and feel the bigger person for having understood and not understood it. Thanks, Grandma."}, {"userName": "Misaki Ohata", "userReviewDate": "Jan 18, 2015", "userURL": "http://www.goodreads.com/user/show/30421257-misaki-ohata", "userReview": "1. IBC publishing level2.2. 1/13 50min 1/14 30 min 1/17 30min3.baobab rose drink fox king planet admire 4. a【Oneday, a boy controles a plane, but he accidently arrives at the Sahara desert, and he meets the little prince. They gradually get to know each other.】b【And now, at night, I love to listento the stars. They sound like five hundred million bells】5.It was a lovely story. There are many wonderful phrases, and they make me think a lot. I want to read it again!"}, {"userName": "Austinn", "userReviewDate": "Sep 05, 2013", "userURL": "http://www.goodreads.com/user/show/23224453-austinn", "userReview": "I first read this book when I was in high school. I didn't understand this back then but now when I re-read it I didn't expect that I'm going to cry. Maybe because I was so happy before and the things around me didn't matter but now all the things and all the happenings in my life are important to understand. Now, all I see is flaws and things that really didn't matter in the first place.Somehow, this books remind me that everything will be okay and don't mind things that aren't important. Just do good in everything and concentrate with the important things.\"But you mustn’t forget it. You become responsible forever for what you’ve tamed. You’re responsible for your rose.” -Fox\"I shall look at you out of the corner of my eye, and you will say nothing. Words are the source of misunderstandings.\" -Fox\"And now here is my secret, a very simple secret : It is only with the heart that one can see rightly ; what is essential is invisible to the eye.\""}, {"userName": "ShaLisa", "userReviewDate": "Oct 22, 2009", "userURL": "http://www.goodreads.com/user/show/1128348-shalisa", "userReview": "Hmmm...what should I say about such a strange little book.  I liked it, I think.  The author carried a new train of thought, refreshing, with a childlike moral.  The book had a message to grownups and reminded me of the mind of a youth - full of questions, no answers, and simple logic.  The author said that, to him, the desert with a solitary star in the horizon is a picture of the loveliest and saddest landscape in the world.  I could draw so much meaning from the simple sentence but I don't believe it that was intended.  The lessons from the other planets are obvious, clear, which I like for the books intent.  I liked the prince.  I liked the sheep.  I liked the other planets and the falacy of thought there, I like the books definition of tame, but I did not like the way the prince disappeared.  The book ends with a questions - does the sheep, with a muzzle that does not work, eat the flower or can the prince save her.  Such a strange little book."}, {"userName": "Christina", "userReviewDate": "Jan 28, 2009", "userURL": "http://www.goodreads.com/user/show/1110169-christina", "userReview": "I showed my masterpiece to the grown-ups, and asked if my drawing frightened them.'Why would a hat frighten anyone?' they answered.My drawing was not of a hat. It was of a boa constrictor digesting an elephant. So then I drew the inside of the boa constrictor, for the benefit of the grown-ups. (Grown-ups always need explanations.) The grown-ups now advised me to give up drawing boa constrictors altogether, from the inside or the outside, and devote myself instead to geography, history, arithmentic and grammar. It's around this moment, on page 2, that I fell in love with The Little Prince. Deeply moving, hilarious, and depressing all rolled into one. I really, really loved it. And the drawings are adorable! I was in hysterics over the elephant inside the boa constrictor. And the sheep in the box. And the haughty rose. What I especially loved, however, was the fact that the things that made me smile, had me in tears a minute later."}, {"userName": "Arka Ray", "userReviewDate": "Apr 18, 2014", "userURL": "http://www.goodreads.com/user/show/27538182-arka-ray", "userReview": "One of my all-time favourites. This was amazing. Truly magical. And I think it's appeal mainly comes not from it's simplistic writing or values (of taming and caring for what you tame), but from it's relevance. We all know at least one person who fits the bill of at least one of the characters the prince meets. Either the one obsessed with something which we find seemingly useless or the narcissistic one or...That's what makes it so... relatable. It also reflects our life and attitude of running away from something or a yearning to find something new or a need to know... Whatever it may be, this book seems to present itself for the reader to imagine. Another reader/critic, Vanda, said she didn't see why it's a children's book. I agree that it is more applicable to adults and the problems they face. However, it can also be considered applicable to some of the conflicts , albeit small, that they face. That's exactly the beauty of the book."}], "description": "The Little Prince is the most translated book in the French language. With a timeless charm it tells the story of a little boy who leaves the safety of his own tiny planet to travel the universe, learning the vagaries of adult behavior through a series of extraordinary encounters. His personal odyssey culminates in a voyage to Earth and further adventures.  Letter to  a Hostage, which contains certain theme that were appear ini The Little Prince, is Saint-Exupery's optimistic and humane open letter to a Jewish intellectual hiding in occupied France in 1943", "title": "The Little Prince & Letter to a Hostage", "url": "http://www.goodreads.com/book/show/3241368-the-little-prince-letter-to-a-hostage", "average": 4.46, "cover": "http://d.gr-assets.com/books/1337132322l/3241368.jpg", "reviews": 222, "authors": [{"url": "http://www.goodreads.com/author/show/1020792.Antoine_de_Saint_Exup_ry", "name": "Antoine de Saint-Exupéry"}, {"url": "http://www.goodreads.com/author/show/6432545.T_V_F_Cuffe", "name": "T.V.F. Cuffe"}], "outlinks": ["http://www.goodreads.com/book/show/147679.The_Little_Prince_Letter_to_a_Hostage", "http://www.goodreads.com/book/show/1490309.The_Little_Prince_Letter_to_a_Hostage", "http://www.goodreads.com/book/show/147679.The_Little_Prince_Letter_to_a_Hostage", "http://www.goodreads.com/book/show/147679.The_Little_Prince_Letter_to_a_Hostage", "http://www.goodreads.com/book/show/147679.The_Little_Prince_Letter_to_a_Hostage", "http://www.goodreads.com/book/show/147679.The_Little_Prince_Letter_to_a_Hostage", "http://www.goodreads.com/book/show/147679.The_Little_Prince_Letter_to_a_Hostage", "http://www.goodreads.com/book/show/72212.The_Kingdom_by_the_Sea", "http://www.goodreads.com/book/show/31626.The_Gift_of_the_Magi_and_Other_Short_Stories", "http://www.goodreads.com/book/show/963121.Perburuan", "http://www.goodreads.com/book/show/143743.The_Ghost_of_Windy_Hill", "http://www.goodreads.com/book/show/1385222.The_Stolen", "http://www.goodreads.com/book/show/13585608-kevin", "http://www.goodreads.com/book/show/6178769-cut-nyak-dien", "http://www.goodreads.com/book/show/876637.Kappa", "http://www.goodreads.com/book/show/162544.Just_Me_and_My_Cousin", "http://www.goodreads.com/book/show/501404.Clifford_Gets_a_Job", "http://www.goodreads.com/book/show/518600.Help_I_m_Trapped_In_Obedience_School", "http://www.goodreads.com/book/show/228032.Cousins", "http://www.goodreads.com/book/show/4821.If_You_Sailed_On_The_Mayflower", "http://www.goodreads.com/book/show/60942.Her_Blue_Body_Everything_We_Know", "http://www.goodreads.com/book/show/1258286.The_Life_and_Death_of_Fritz_the_Cat", "http://www.goodreads.com/book/show/63658.Night_in_the_Country", "http://www.goodreads.com/book/show/1047511.You_Shouldn_t_Have_to_Say_Goodbye", "http://www.goodreads.com/book/show/1413465.Badger_in_the_Basement", "http://www.goodreads.com/book/show/157993.The_Little_Prince", "http://www.goodreads.com/book/show/8837.Wind_Sand_and_Stars", "http://www.goodreads.com/book/show/8842.Night_Flight", "http://www.goodreads.com/book/show/225640.Citadelle", "http://www.goodreads.com/book/show/157996.Flight_to_Arras"]}